print('Як тебе звати?')
nameUser = input('впишіть своє ім`я:\n')
print(f'Привіт,{nameUser}. Мене звати бот Тузік Контузік.')
print('А скільки тобі років?\n')
Bik = input()
print("Ясненько,а мені 10хв 40с\n")
print('а ти кимось працюєш')
R = input("")
print(f"ти працюєш "
      f"{R} ? А я працюю щоб ноут мого хазяїна"
      f" згорів і його батьки купили йому нове залізо. ")
print(f'{nameUser} а ти розбиаєшся в політиці? яка твоя думка нащот цієї всієї фігні з трампом?')
pol = input('')
print(f"ніфігасє ти висказався-{pol}. Ну а трамп реально Дембил")




