score = 0  # початкове значення балів

# Питання 1
print("1. Який одяг найкраще підійде для дощової погоди?")
print("a) Шорти та футболка\nb) Пуховик\nc) Дощовик або куртка з капюшоном\nd) Сандалі")
answer = input("Ваша відповідь: ")
if answer == "c":
    score = score + 1  # інкремент

# Питання 2
print("\n2. Що краще взути в сніг?")
print("a) Кросівки\nb) Черевики з утепленням\nc) Тапочки\nd) Балетки")
answer = input("Ваша відповідь: ")
if answer == "b":
    score = score + 1  # інкремент

# Питання 3
print("\n3. Якщо температура +30°C, що краще вдягнути?")
print("a) Светр і джинси\nb) Шапку і шарф\nc) Легкий одяг з натуральних тканин\nd) Пальто")
answer = input("Ваша відповідь: ")
if answer == "c":
    score = score + 1  # інкремент

# Питання 4
print("\n4. При сильному вітрі краще...")
print("a) Йти в шортах\nb) Надіти вітрозахисну куртку\nc) Йти без верхнього одягу\nd) Ходити босоніж")
answer = input("Ваша відповідь: ")
if answer == "b":
    score = score + 1  # інкремент

# Питання 5
print("\n5. Що вдягти при температурі -10°C?")
print("a) Кофта\nb) Літня сукня\nc) Зимова куртка, шапка і рукавиці\nd) Майка і шорти")
answer = input("Ваша відповідь: ")
if answer == "c":
    score = score + 1  # інкремент

# Питання 6
print("\n6. Які матеріали краще для спекотної погоди?")
print("a) Вовна\nb) Поліестер\nc) Льон або бавовна\nd) Шкіра")
answer = input("Ваша відповідь: ")
if answer == "c":
    score = score + 1  # інкремент

# Питання 7
print("\n7. Якщо на вулиці туман, яку куртку краще вдягнути?")
print("a) Яскравого кольору, щоб бути помітним\nb) Темну, щоб злитись із середовищем\nc) Прозору\nd) Без куртки")
answer = input("Ваша відповідь: ")
if answer == "a":
    score = score + 1  # інкремент

# Питання 8
print("\n8. Що взяти із собою в похід, якщо обіцяють дощ?")
print("a) Сонцезахисні окуляри\nb) Зонт або дощовик\nc) Купальник\nd) Шорти")
answer = input("Ваша відповідь: ")
if answer == "b":
    score = score + 1  # інкремент

# Питання 9
print("\n9. Яке взуття найкраще в спеку?")
print("a) Черевики\nb) Тапочки або сандалі\nc) Гумові чоботи\nd) Зимові кросівки")
answer = input("Ваша відповідь: ")
if answer == "b":
    score = score + 1  # інкремент

# Питання 10
print("\n10. Що одягнути восени, коли погода змінюється часто?")
print("a) Теплий светр, легка куртка і взяти з собою зонт\nb) Шорти\nc) Майку і капці\nd) Купальник")
answer = input("Ваша відповідь: ")
if answer == "a":
    score = score + 1  # інкремент

# Вивід результату
print("\nТест завершено!")
print("Ви набрали", score, "з 10 балів.")
